garyPenhook/PyAvrOCD/svd/atmega169a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC0</name>
      <description>Timer/Counter, 8-bit</description>
      <baseAddress>0x00800035</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x11</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GTCCR</name>
          <description>General Timer/Control Register</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSR10</name>
              <description>Prescaler Reset Timer/Counter1 and Timer/Counter0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR0A</name>
          <description>Timer/Counter0 Output Compare Register</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR0A</name>
          <description>Timer/Counter0 Control Register</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS0</name>
              <description>Clock Selects</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK_SOURCE_STOPPED</name>
                  <description>No Clock Source (Stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_NO_PRESCALING</name>
                  <description>Running, No Prescaling</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_8</name>
                  <description>Running, CLK/8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_64</name>
                  <description>Running, CLK/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_256</name>
                  <description>Running, CLK/256</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_1024</name>
                  <description>Running, CLK/1024</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_EXTCLK_TN_FALLING_EDGE</name>
                  <description>Running, ExtClk Tn Falling Edge</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_EXTCLK_TN_RISING_EDGE</name>
                  <description>Running, ExtClk Tn Rising Edge</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WGM01</name>
              <description>Waveform Generation Mode 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COM0A</name>
              <description>Compare Match Output Modes</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WGM00</name>
              <description>Waveform Generation Mode 0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTC</name>
                  <description>CTC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOC0A</name>
              <description>Force Output Compare</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT0</name>
          <description>Timer/Counter0</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR0</name>
          <description>Timer/Counter0 Interrupt Flag register (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV0</name>
              <description>Timer/Counter0 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF0A</name>
              <description>Timer/Counter0 Output Compare Flag 0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK0</name>
          <description>Timer/Counter0 Interrupt Mask Register</description>
          <addressOffset>0x39</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOIE0</name>
              <description>Timer/Counter0 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE0A</name>
              <description>Timer/Counter0 Output Compare Match Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
